# ColumnTooLong Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ColumnTooLong Property
BuiltInFailures..::..FamilyFailures Class See Also
---
This column is too long. Maximum length is 30,000 ft.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnTooLong { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnTooLong As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnTooLong {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace